Sparkleiot/BK7239N_AT/middleware/soc/bk7239n/hal/sys_hal.c
	pm_cpu_freq_e prev_freq = s_pre_cpu_freq;

	if(prev_freq == cpu_bus_freq)
		return BK_OK;

	if(prev_freq > cpu_bus_freq)// eg: 120->60
	{
		sys_hal_switch_cpu_bus_freq_high_to_low(cpu_bus_freq);
	}
	else // eg: 60-120
	{
		sys_hal_switch_cpu_bus_freq_low_to_high(cpu_bus_freq);
	}
	s_pre_cpu_freq = cpu_bus_freq;

	return ret;
}
bk_err_t sys_hal_cpu_freq_dump()
{
	uint32_t value_8 = 0;
	uint32_t value_4 = 0;
	//uint32_t value_5 = 0;
	uint32_t cp0_div = 0;
	//uint32_t cp1_div = 0;
	value_8 = REG_READ(PM_SYS_REG_0x8);
	value_4 = REG_READ(PM_SYS_REG_0x4);

	if(((value_4>>4)&0x1) == 0x1)
	{
		cp0_div = (value_8&0xF)+1;
	}
	else
	{
		cp0_div = ((value_8&0xF)+1)*2;
	}

	switch((value_8 >> PM_CPU_SRC_POS)&PM_CPU_SRC_MASK)
	{
		case PM_CLKSEL_CORE_480M:
			LOGI("Cur freq: CPU0:(480/%d)M\r\n",cp0_div);
			break;
		default:
			break;
	}
	LOGI("freq_reg:0x%x,0x%x\r\n",value_8,value_4);
	return BK_OK;
}
/*for low power function end*/
/*sleep feature end*/

uint32 sys_hal_get_chip_id(void)
{
	return sys_ll_get_version_id_versionid();
}

uint32 sys_hal_get_device_id(void)
{
	return sys_ll_get_device_id_deviceid();
}

__IRAM_SEC int32 sys_hal_int_disable(uint32 param) //CMD_ICU_INT_DISABLE
{
	uint32 reg = 0;
	uint32 value = 0;

	reg = sys_ll_get_cpu0_int_0_31_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu0_int_0_31_en_value(reg);

	return value;
}

__IRAM_SEC int32 sys_hal_int_enable(uint32 param) //CMD_ICU_INT_ENABLE
{
	uint32 reg = 0;

	reg = sys_ll_get_cpu0_int_0_31_en_value();
	reg |= (param);
	sys_ll_set_cpu0_int_0_31_en_value(reg);

	return 0;
}

//NOTICE:Temp add for BK7256 product which has more then 32 Interrupt sources
__IRAM_SEC int32 sys_hal_int_group2_disable(uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

	reg = sys_ll_get_cpu0_int_32_63_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);

	return value;
}

//NOTICE:Temp add for BK7256 product which has more then 32 Interrupt sources
__IRAM_SEC int32 sys_hal_int_group2_enable(uint32 param)
{
	uint32 reg = 0;

	reg = sys_ll_get_cpu0_int_32_63_en_value();
	reg |= (param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);

	return 0;
}

#if CONFIG_SOC_BK7239N_SMP_TEMP
int32 sys_hal_core_int_group1_disable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_0_31_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu0_int_0_31_en_value(reg);
	}

	return value;
}

int32 sys_hal_core_int_group1_enable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_0_31_en_value();
		reg |= (param);
		sys_ll_set_cpu0_int_0_31_en_value(reg);
	}

	return 0;
}

int32 sys_hal_core_int_group2_disable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_32_63_en_value();
		value = reg;
		reg &= ~(param);
		sys_ll_set_cpu0_int_32_63_en_value(reg);
	}

	return value;
}

int32 sys_hal_core_int_group2_enable(uint32 core_id, uint32 param)
{
	uint32 reg = 0;

	if(CPU0_CORE_ID == core_id){
		reg = sys_ll_get_cpu0_int_32_63_en_value();
		reg |= (param);
		sys_ll_set_cpu0_int_32_63_en_value(reg);
	}

	return 0;
}
#endif

int32 sys_hal_fiq_disable(uint32 param)
{
	uint32 reg = 0;
	uint32 value = 0;

	reg = sys_ll_get_cpu0_int_32_63_en_value();
	value = reg;
	reg &= ~(param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);

	return value;
}

int32 sys_hal_fiq_enable(uint32 param)
{
	uint32 reg = 0;

	reg = sys_ll_get_cpu0_int_32_63_en_value();
	reg |= (param);
	sys_ll_set_cpu0_int_32_63_en_value(reg);

	return 0;
}

int32 sys_hal_global_int_disable(uint32 param)
{
	int32 ret = 0;

	return ret;
}

int32 sys_hal_global_int_enable(uint32 param)
{
	int32 ret = 0;

	return ret;
}

uint32 sys_hal_get_int_status(void)
{
	return sys_ll_get_cpu0_int_0_31_status_value();
}

__attribute__((section(".itcm_sec_code"))) uint32 sys_hal_get_int_group2_status(void)
{
	return sys_ll_get_cpu0_int_32_63_status_value();
}

/* REG_0x29:cpu0_int_32_63_status->cpu0_gpio_int_st: ,R,0x29[22]*/
uint32_t sys_hal_get_cpu0_gpio_int_st(void)
{
    return sys_ll_get_cpu0_int_32_63_en_cpu0_gpio_s_int_en();
}

//NOTICE:INT source status is read only and can't be set, other projects is error, we'll delete them.
int32 sys_hal_set_int_status(uint32 param)
{
	return 0;
}

uint32 sys_hal_get_fiq_reg_status(void)
{
	uint32 reg = 0;

	reg = sys_ll_get_cpu0_int_32_63_status_value();

	return reg;
}

uint32 sys_hal_set_fiq_reg_status(uint32 param)
{
	uint32 reg = 0;

	///TODO:this reg is read only

	return reg;
}

uint32 sys_hal_get_intr_raw_status(void)
{
	uint32 reg = 0;

	///TODO:
	reg = sys_ll_get_cpu0_int_0_31_status_value();

	return reg;
}

uint32 sys_hal_set_intr_raw_status(uint32 param)
{
	uint32 reg = 0;

	///TODO:this reg is read only

	return reg;
}

int32 sys_hal_set_jtag_mode(uint32 param)
{
	return 0;
}

uint32 sys_hal_get_jtag_mode(void)
{
	return 0;
}

/* NOTICE: NOTICE: NOTICE: NOTICE: NOTICE: NOTICE: NOTICE
 * BK7256 clock, power is different with previous products(2022-01-10).
 * Previous products peripheral devices use only one signal of clock enable.
 * BK7256 uses clock and power signal to control one device,
 * This function only enable clock signal, we needs to enable power signal also
 * if we want to enable one device.
 */
__IRAM_SEC void sys_hal_clk_pwr_ctrl(dev_clk_pwr_id_t dev, dev_clk_pwr_ctrl_t power_up)
{
	uint32_t v = 0;

    BK_ASSERT(CLK_PWR_ID_NONE > dev);

	v = sys_ll_get_cpu_device_clk_enable_value();

	if(CLK_PWR_CTRL_PWR_UP == power_up)
		v |= (1 << dev);
	else
		v &= ~(1 << dev);

	sys_ll_set_cpu_device_clk_enable_value(v);
}

/* UART select clock **/
void sys_hal_uart_select_clock(uart_id_t id, uart_src_clk_t mode)
{
	int sel_xtal = 0;
	int sel_80m = 1;

	switch(id)
	{
		case UART_ID_0:
			{
				if(mode == UART_SCLK_80M)
					sys_ll_set_cpu_clk_div_mode1_cksel_uart0(sel_80m);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_uart0(sel_xtal);
				break;
			}
		case UART_ID_1:
			{
				if(mode == UART_SCLK_80M)
					sys_ll_set_cpu_clk_div_mode1_cksel_uart1(sel_80m);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_uart1(sel_xtal);
				break;
			}
		case UART_ID_2:
			{
				if(mode == UART_SCLK_80M)
					sys_ll_set_cpu_clk_div_mode1_cksel_uart2(sel_80m);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_uart2(sel_xtal);
				break;
			}
#if (SOC_UART_ID_NUM_PER_UNIT  >= 4)
		case UART_ID_3:
			{
				if(mode == UART_SCLK_80M)
					sys_ll_set_cpu_clk_div_mode1_cksel_uart2(sel_80m);
				else
					sys_ll_set_cpu_clk_div_mode1_cksel_uart2(sel_xtal);
				break;
			}
#endif
		default:
			break;
	}

