Sparkleiot/BK7239N_AT/middleware/soc/bk7239n/hal/sys_hal.c
void sys_hal_mclk_div_set(uint32_t value)
{
	sys_ll_set_cpu_clk_div_mode1_clkdiv_core(value);
}

/**  Platform End **/




/**  BT Start **/
//BT
void sys_hal_bt_power_ctrl(bool power_up)
{
    if (power_up)
    {
        sys_ll_set_cpu_power_sleep_wakeup_pwd_btsp(0);
    }
    else
    {
        sys_ll_set_cpu_power_sleep_wakeup_pwd_btsp(1);
    }
}

void sys_hal_bt_clock_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu_device_clk_enable_btdm_cken(1);
    }
    else
    {
        sys_ll_set_cpu_device_clk_enable_btdm_cken(0);
    }
}

void sys_hal_xvr_clock_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu_device_clk_enable_xvr_cken(1);
    }
    else
    {
        sys_ll_set_cpu_device_clk_enable_xvr_cken(0);
    }
}

void sys_hal_btdm_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_dm_irq_int_en(1);
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_dm_irq_int_en(0);
    }
}

void sys_hal_ble_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ble_irq_int_en(1);
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ble_irq_int_en(0);
    }
}

void sys_hal_bt_interrupt_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_bt_irq_int_en(1);
    }
    else
    {
        sys_ll_set_cpu0_int_32_63_en_cpu0_bt_irq_int_en(0);
    }
}

void sys_hal_thread_interrupt_ctrl(bool en)
{
    if (en) {
        sys_ll_set_cpu0_int_32_63_en_cpu0_thread_int_en(1);
    } else {
        sys_ll_set_cpu0_int_32_63_en_cpu0_thread_int_en(0);
    }
}

void sys_hal_bt_rf_ctrl(bool en)
{
    if (en)
    {
        //todo
    }
    else
    {
        //todo
    }
}

void sys_hal_rf_ctrl(uint8_t type)
{
    if (type == RF_CTRL_PTA) {
        // rf ctrl by PTA
        sys_ll_set_cpu_storage_connect_op_select_rf_switch_manual_en(0);
    } else if (type == RF_CTRL_WIFI) {
        // rf ctrl by Wi-Fi
        sys_ll_set_cpu_storage_connect_op_select_rf_switch_manual_en(1);
        sys_ll_set_cpu_storage_connect_op_select_rf_source(RF_CTRL_WIFI);
    } else if (type == RF_CTRL_BT) {
        // rf ctrl by BT
        sys_ll_set_cpu_storage_connect_op_select_rf_switch_manual_en(1);
        sys_ll_set_cpu_storage_connect_op_select_rf_source(RF_CTRL_BT);
    } else if (type == RF_CTRL_THREAD) {
        // rf ctrl by thread
       sys_ll_set_cpu_storage_connect_op_select_rf_switch_manual_en(1);
       sys_ll_set_cpu_storage_connect_op_select_rf_source(RF_CTRL_THREAD);
    }
}

uint8_t sys_hal_rf_ctrl_type_get(void)
{
    uint8_t type = 0;
    if (sys_ll_get_cpu_storage_connect_op_select_rf_switch_manual_en()) {
        type = sys_ll_get_cpu_storage_connect_op_select_rf_source();
        if (type == RF_CTRL_PTA || type == RF_CTRL_WIFI) {
            type = RF_CTRL_WIFI;
        }
    } else {
        type = RF_CTRL_PTA;
    }

    return type;
}

uint32_t sys_hal_bt_rf_status_get(void)
{
    //todo
    return 0;
}

void sys_hal_bt_sleep_exit_ctrl(bool en)
{
    if (en)
    {
        sys_ll_set_cpu_power_sleep_wakeup_bts_soft_wakeup_req(1);
    }
    else
    {
        sys_ll_set_cpu_power_sleep_wakeup_bts_soft_wakeup_req(0);
    }
}

void sys_hal_set_bts_wakeup_platform_en(bool value)
{
	/*TODO
	sys_ll_set_cpu_power_sleep_wakeup_bts_wakeup_platform_en(value);*/
	while(1){;}
}

uint32 sys_hal_get_bts_wakeup_platform_en()
{
	/*TODO
	sys_ll_get_cpu_power_sleep_wakeup_bts_wakeup_platform_en();*/
	while(1){;}
	return 0;
}

/**
  * @brief	dma2d system config
  * param1: clk source sel 0:clk_320M	   1:clk_480M,
  * param2: clk_always_on  ENABLE,0: bus clock auto open when module is select,1:bus clock always open
  * param1: int_en eanble lcd cpu int
  * return none
  */
void sys_hal_dma2d_clk_en(uint8_t clk_always_on)
{
}

void sys_hal_set_jpeg_dec_disckg(uint32_t value)
{
}

/**  Video End **/

/**  WIFI Start **/
//WIFI

//Yantao Add Start
void sys_hal_modem_core_reset(void)
{
	//TODO, 7256 NO modem core reset
}

void sys_hal_mpif_invert(void)
{
	//TODO, 7256 NO mpif_invert
}

void sys_hal_modem_subsys_reset(void)
{
	//TODO, 7256 NO subsys reset
}
void sys_hal_mac_subsys_reset(void)
{
	//TODO, 7256 NO subsys reset
}
void sys_hal_dsp_subsys_reset(void)
{
	//TODO, 7256 NO subsys reset
}
void sys_hal_mac_power_ctrl(bool power_up)
{
	//WARNING:the low-level is power-down
	sys_ll_set_cpu_power_sleep_wakeup_pwd_wifp_mac(!(power_up));
}

void sys_hal_modem_power_ctrl(bool power_up)
{
	sys_ll_set_cpu_power_sleep_wakeup_pwd_wifp_phy(!(power_up));
}

void sys_hal_pta_ctrl(bool pta_en)
{
	//TODO, 7256 NO pta enable
}

__IRAM_SEC void sys_hal_modem_bus_clk_ctrl(bool clk_en)
{
	//TODO, 7256 no bus clock enable
}

__IRAM_SEC void sys_hal_modem_clk_ctrl(bool clk_en)
{
	sys_ll_set_cpu_device_clk_enable_phy_cken(clk_en);
}


void sys_hal_mac_bus_clk_ctrl(bool clk_en)
{
	//TODO, 7256 no bus clock enable
}

void sys_hal_mac_clk_ctrl(bool clk_en)
{
	sys_ll_set_cpu_device_clk_enable_mac_cken(clk_en);
}



void sys_hal_set_vdd_value(uint32_t param)
{
	sys_hal_ctrl_vdddig_h_vol(param);
}

uint32_t sys_hal_get_vdd_value(void)
{
	return sys_ana_ll_get_ana_reg8_vcorehsel();
}

//CMD_SCTRL_BLOCK_EN_MUX_SET
void sys_hal_block_en_mux_set(uint32_t param)
{
	//TODO 7256 no block en mux
}

__IRAM_SEC void sys_hal_set_sys2flsh_2wire(uint32_t value)
{
}

void sys_hal_enable_mac_gen_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_mac_int_gen_int_en(1);
}

void sys_hal_enable_mac_prot_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_port_trigger_int_en(1);
}

void sys_hal_enable_mac_tx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_tx_trigger_int_en(1);
}

void sys_hal_enable_mac_rx_trigger_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_rx_trigger_int_en(1);
}

void sys_hal_enable_mac_txrx_misc_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_tx_rx_misc_int_en(1);
}

void sys_hal_enable_mac_txrx_timer_int(void)
{
	sys_ll_set_cpu0_int_32_63_en_cpu0_mac_int_tx_rx_timer_int_en(1);
}

void sys_hal_enable_modem_int(void)
{
}

void sys_hal_enable_modem_rc_int(void)
{
}

void sys_hal_enable_hsu_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_hsu_irq_int_en(1);
}

void sys_hal_disable_hsu_int(void)
{
	sys_ll_set_cpu0_int_0_31_en_cpu0_hsu_irq_int_en(0);
}

void sys_hal_set_debug_mux(int type)
{
	sys_ll_set_dbug_config0_dbug_mux(type);
}

// Set debug port to mac
void sys_hal_diag_debug_mac()
{
	sys_ll_set_dbug_config0_dbug_mux(DIAG_DEBUG_MAC);
}

// Set debug port to phy
void sys_hal_diag_debug_phy()
{
	sys_ll_set_dbug_config0_dbug_mux(DIAG_DEBUG_PHY);
}

// Set GPIO Mux for Debug Purpose.
void dbg_enable_debug_gpio(void)
{
	// 2 -> 9
	gpio_dev_unmap(GPIO_2);
	gpio_dev_map(GPIO_2, GPIO_DEV_DEBUG0);
	gpio_dev_unmap(GPIO_3);
	gpio_dev_map(GPIO_3, GPIO_DEV_DEBUG1);
	gpio_dev_unmap(GPIO_4);
	gpio_dev_map(GPIO_4, GPIO_DEV_DEBUG2);
	gpio_dev_unmap(GPIO_5);
	gpio_dev_map(GPIO_5, GPIO_DEV_DEBUG3);
	gpio_dev_unmap(GPIO_6);
	gpio_dev_map(GPIO_6, GPIO_DEV_DEBUG4);
	gpio_dev_unmap(GPIO_7);
	gpio_dev_map(GPIO_7, GPIO_DEV_DEBUG5);
	gpio_dev_unmap(GPIO_8);
	gpio_dev_map(GPIO_8, GPIO_DEV_DEBUG6);
	gpio_dev_unmap(GPIO_9);
	gpio_dev_map(GPIO_9, GPIO_DEV_DEBUG7);

