Sparkleiot/BK7239N_AT/middleware/soc/bk7239n/hal/sys_hal.c
	// 12 -> 19
	gpio_dev_unmap(GPIO_12);
	gpio_dev_map((GPIO_12), GPIO_DEV_DEBUG8);
	gpio_dev_unmap(GPIO_13);
	gpio_dev_map(GPIO_13, GPIO_DEV_DEBUG9);
	gpio_dev_unmap(GPIO_14);
	gpio_dev_map((GPIO_14), GPIO_DEV_DEBUG10);
	gpio_dev_unmap(GPIO_15);
	gpio_dev_map(GPIO_15, GPIO_DEV_DEBUG11);
	gpio_dev_unmap(GPIO_16);
	gpio_dev_map((GPIO_16), GPIO_DEV_DEBUG12);
	gpio_dev_unmap(GPIO_17);
	gpio_dev_map(GPIO_17, GPIO_DEV_DEBUG13);
	gpio_dev_unmap(GPIO_18);
	gpio_dev_map(GPIO_18, GPIO_DEV_DEBUG14);
	gpio_dev_unmap(GPIO_19);
	gpio_dev_map(GPIO_19, GPIO_DEV_DEBUG15);
}
//Yantao Add End

void sys_hal_cali_dpll_spi_trig_disable(void)
{
	// NOT SUPPORT
}

void sys_hal_cali_dpll_spi_trig_enable(void)
{
	// NOT SUPPORT
}

void sys_hal_cali_dpll_spi_detect_disable(void)
{
    sys_ana_ll_set_ana_reg1_osccal_trig(0);
}

void sys_hal_cali_dpll_spi_detect_enable(void)
{
    sys_ana_ll_set_ana_reg1_osccal_trig(1);
}

void sys_hal_set_xtalh_ctune(uint32_t value)
{
    sys_ana_ll_set_ana_reg2_xtalh_ctune(value);
}

void sys_hal_analog_set(analog_reg_t reg, uint32_t value)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	sys_ll_set_analog_reg_value(analog_reg_address, value);
}

__IRAM_SEC void sys_hal_analog_set_iram(analog_reg_t reg, uint32_t value)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	sys_ll_set_analog_reg_value_iram(analog_reg_address, value);
}

uint32_t sys_hal_analog_get(analog_reg_t reg)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return 0;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	return sys_ll_get_analog_reg_value(analog_reg_address);
}

__IRAM_SEC uint32_t sys_hal_analog_get_iram(analog_reg_t reg)
{
    uint32_t analog_reg_address;

    if ((reg < ANALOG_REG0) || (reg >= ANALOG_MAX)) {
        return 0;
    }

    analog_reg_address = SYS_ANA_REG0_ADDR + (reg - ANALOG_REG0) * 4;

	return sys_ll_get_analog_reg_value_iram(analog_reg_address);
}

void sys_hal_set_ana_reg1_value(uint32_t value)
{
    sys_ana_ll_set_ana_reg1_value(value);
}

void sys_hal_set_ana_reg2_value(uint32_t value)
{
    sys_ana_ll_set_ana_reg2_value(value);
}

void sys_hal_set_ana_reg3_value(uint32_t value)
{
    sys_ana_ll_set_ana_reg3_value(value);
}

void sys_hal_set_ana_reg4_value(uint32_t value)
{
    sys_ana_ll_set_ana_reg4_value(value);
}

void sys_hal_set_ana_reg12_value(uint32_t value)
{
    sys_ana_ll_set_ana_reg12_value(value);
}

void sys_hal_set_ana_reg13_value(uint32_t value)
{
    //sys_ll_set_ana_reg13_value(value);
}

void sys_hal_set_ana_reg14_value(uint32_t value)
{
    //sys_ll_set_ana_reg14_value(value);
}

void sys_hal_set_ana_reg15_value(uint32_t value)
{
    //sys_ll_set_ana_reg15_value(value);
}

void sys_hal_set_ana_reg16_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg17_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg18_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg19_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg20_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg21_value(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_set_ana_reg27_value(uint32_t value)
{
	// NOT SUPPORT
}

uint32_t sys_hal_bias_reg_read(void)
{
	///TODO
    return 0;
}
uint32_t sys_hal_bias_reg_write(uint32_t param)
{
	///TODO

	return 0;

}

uint32_t sys_hal_analog_reg2_get(void)
{
	///TODO

    return 0;
}

uint32_t sys_hal_bias_reg_set(uint32_t param)
{
	///TODO

	return 0;
}

uint32_t sys_hal_bias_reg_clean(uint32_t param)
{
	///TODO

	return 0;
}


uint32_t sys_hal_get_xtalh_ctune(void)
{
    return sys_ana_ll_get_ana_reg2_xtalh_ctune();
}

uint32_t sys_hal_cali_bgcalm(void)
{
    uint32_t bandgap;

    sys_ana_ll_set_ana_reg8_spi_latch1v(1);
    sys_ana_ll_set_ana_reg7_pwd_bgcal(0);
    sys_ana_ll_set_ana_reg7_vbgcalmode(0);
    sys_ana_ll_set_ana_reg7_vbgcalstart(0);
    sys_ana_ll_set_ana_reg7_vbgcalstart(1);
    bk_delay_us(100); //100us
    sys_ana_ll_set_ana_reg7_vbgcalstart(0);

    bk_delay_us(2000); //2ms to avoid consistency issue

    bandgap = aon_pmu_ll_get_r7d_bgcal();

    sys_ana_ll_set_ana_reg7_vbgcalmode(1);
    sys_ana_ll_set_ana_reg7_pwd_bgcal(1);
    sys_ana_ll_set_ana_reg8_spi_latch1v(0);

    return bandgap;
}

uint32_t sys_hal_get_bgcalm(void)
{
    return sys_ana_ll_get_ana_reg7_bgcal();
}

void sys_hal_set_bgcalm(uint32_t value)
{
    sys_ana_ll_set_ana_reg8_spi_latch1v(1);
    sys_ana_ll_set_ana_reg7_bgcal(value);
    sys_ana_ll_set_ana_reg8_spi_latch1v(0);
}

void sys_hal_set_audioen(uint32_t value)
{
}

void sys_hal_set_dpll_div_cksel(uint32_t value)
{
}

void sys_hal_set_dpll_reset(uint32_t value)
{
}

void sys_hal_set_gadc_ten(uint32_t value)
{
}
/**  WIFI End **/

/**  Audio Start  **/

void sys_hal_aud_select_clock(uint32_t value)
{
}

void sys_hal_aud_clock_en(uint32_t value)
{
}

void sys_hal_aud_mic1_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dacl_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_diffen_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic_rst_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic1_gain_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dcoc_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_lmdcin_set(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_audbias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_adcbias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_micbias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dac_bias_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_idac_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_dac_drv_en(uint32_t value)
{
	// NOT SUPPORT
}

void sys_hal_aud_mic1_single_en(uint32_t value)
{
}

void sys_hal_aud_mic2_single_en(uint32_t value)
{
}

void sys_hal_aud_int_en(uint32_t value)
{
}

