Sparkleiot/BK7239N_AT/middleware/soc/bk7239n/hal/sys_hal.c
void sys_hal_nmi_wdt_set_clk_div(uint32_t value)
{
	sys_ll_set_cpu_26m_wdt_clk_div_ckdiv_wdt(value);
}

__IRAM_SEC uint32_t sys_hal_nmi_wdt_get_clk_div(void)
{
	return sys_ll_get_cpu_26m_wdt_clk_div_ckdiv_wdt();
}


void sys_hal_set_ana_cb_cal_manu_val(uint32_t value)
{
    sys_ana_ll_set_ana_reg5_vbias(value);
}

__IRAM_SEC void sys_hal_set_ana_reg11_apfms(uint32_t value) {
	// NOT SUPPORT
}

__IRAM_SEC void sys_hal_set_ana_reg12_dpfms(uint32_t value) {
	// NOT SUPPORT
}

#if CONFIG_ANA_RTC || CONFIG_ANA_GPIO
void sys_hal_set_ana_reg8_spi_latch1v(uint32_t value)
{
	sys_ana_ll_set_ana_reg8_spi_latch1v(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_spi_latch1v_iram(uint32_t value)
{
	sys_ana_ll_set_ana_reg8_spi_latch1v_iram(value);
}

void sys_hal_set_ana_reg5_adc_div(uint32_t value)
{
	//sys_ll_set_ana_reg5_adc_div(value);
}

void sys_hal_set_ana_reg5_pwd_rosc_spi(uint32_t value)
{
	sys_ana_ll_set_ana_reg5_pwd_rosc_spi(value);
}
void sys_hal_set_ana_reg5_rosc_disable(uint32_t value)
{
	sys_ana_ll_set_ana_reg5_rosc_disable(value);
}

__IRAM_SEC void sys_hal_set_ana_reg7_timer_wkrstn(uint32_t value)
{
	sys_ana_ll_set_ana_reg7_timer_wkrstn(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_rst_timerwks1v(uint32_t value)
{
	sys_ana_ll_set_ana_reg8_rst_timerwks1v(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_rst_gpiowks(uint32_t value)
{
	sys_ana_ll_set_ana_reg8_rst_gpiowks(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_lvsleep_wkrst(uint32_t value)
{
	sys_ana_ll_set_ana_reg8_lvsleep_wkrstn(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_gpiowk_rstn(uint32_t value)
{
	sys_ana_ll_set_ana_reg8_gpiowk_rstn(value);
}

__IRAM_SEC void sys_hal_set_ana_reg8_rtcwk_rstn(uint32_t value)
{
	sys_ana_ll_set_ana_reg8_rtcwk_rstn(value);
}
void sys_hal_set_ana_reg8_ensfsdd(uint32_t value)
{
	sys_ana_ll_set_ana_reg8_ensfsdd(value);
}

void sys_hal_set_ana_reg8_vlden(uint32_t value)
{
	sys_ana_ll_set_ana_reg8_vlden(value);
}

void sys_hal_set_ana_reg8_pwdovp1v(uint32_t value)
{
	//sys_ana_ll_set_ana_reg8_pwdovp1v(value);
}
void sys_hal_set_ana_reg9_spi_timerwken(uint32_t value)
{
	sys_ana_ll_set_ana_reg9_spi_timerwken(value);
}

void sys_hal_set_ana_reg7_clk_sel(uint32_t value)
{
	sys_ana_ll_set_ana_reg7_clk_sel(value);
}

void sys_hal_set_ana_reg9_spi_byp32pwd(uint32_t value)
{
	sys_ana_ll_set_ana_reg9_spi_byp32pwd(value);
}

uint32_t sys_hal_get_ana_reg11_gpiowk(void)
{
	return sys_ana_ll_get_ana_reg11_gpiowk();
}

__IRAM_SEC void sys_hal_set_ana_reg11_gpiowk(uint32_t value)
{
	sys_ana_ll_set_ana_reg11_gpiowk(value);
}

__IRAM_SEC uint32_t sys_hal_get_ana_reg11_rtcsel(void)
{
	return sys_ana_ll_get_ana_reg11_rtcsel();
}

__IRAM_SEC void sys_hal_set_ana_reg11_rtcsel(uint32_t value)
{
	sys_ana_ll_set_ana_reg11_rtcsel(value);
}

__IRAM_SEC uint32_t sys_hal_get_ana_reg11_timersel(void)
{
	return sys_ana_ll_get_ana_reg11_timersel();
}

__IRAM_SEC void sys_hal_set_ana_reg11_timersel(uint32_t value)
{
	sys_ana_ll_set_ana_reg11_timersel(value);
}

__IRAM_SEC uint32_t sys_hal_get_ana_reg12_timersel(void)
{
	return sys_ana_ll_get_ana_reg12_timersel();
}

__IRAM_SEC void sys_hal_set_ana_reg12_timersel(uint32_t value)
{
	sys_ana_ll_set_ana_reg12_timersel(value);
}

__IRAM_SEC uint32_t sys_hal_get_ana_reg13_rtcsel(void)
{
	return sys_ana_ll_get_ana_reg13_rtcsel();
}

__IRAM_SEC void sys_hal_set_ana_reg13_rtcsel(uint32_t value)
{
	sys_ana_ll_set_ana_reg13_rtcsel(value);
}
#endif

static void sys_hal_delay(volatile uint32_t times)
{
        while(times--);
}

__IRAM_SEC void sys_hal_adjust_dpll(void)
{
    uint32_t unlock, unlockL = 0, unlockH = 0;
    int32_t dpll_band, count;

    unlock = aon_pmu_hal_get_dpll_unlock(&unlockL, &unlockH);
    //bk_printf("unlock=%d+%d=>%d,band=%d\n", unlockL, unlockH, unlock, sys_ana_ll_get_ana_reg1_bandmanual());
    if (!unlock) {
        return;
    }
    dpll_band = (int32_t)sys_ana_ll_get_ana_reg1_bandmanual();
    for (count = 7; count > 0; count--) {
        if (unlockL) {
            dpll_band++;
        } else {
            dpll_band--;
        }
        if (dpll_band < 0) {
            break;
        } else if (dpll_band > 0x7F) {
            break;
        }
        sys_ana_ll_set_ana_reg1_bandmanual(dpll_band);
    }
}

uint32_t sys_hal_cali_dpll(uint32_t first_time)
{
    uint32_t int_mask = sys_hal_int_group2_disable(DPLL_UNLOCK_INTERRUPT_CTRL_BIT);

    //liupeng20250519: disable unlock detecter and delay 20us when cali dpll
    sys_ana_ll_set_ana_reg0_cben(1);
    sys_ana_ll_set_ana_reg1_manual(0);
    sys_hal_delay(340);

    sys_hal_cali_dpll_spi_detect_disable();

    if (first_time)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

	sys_hal_cali_dpll_spi_detect_enable();

    if (first_time)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

    //ronghui20250604: toggle twice to avoid wrong value after 0x40<29:28>=1
    sys_hal_cali_dpll_spi_detect_disable();

    if (first_time)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

	sys_hal_cali_dpll_spi_detect_enable();

    if (first_time)
    {
        sys_hal_delay(3400);
    }
    else
    {
        sys_hal_delay(340);
    }

    sys_ana_ll_set_ana_reg1_bandmanual(aon_pmu_hal_get_dpll_band());
    sys_ana_ll_set_ana_reg1_manual(1);
    sys_ana_ll_set_ana_reg0_cben(0);

    if (int_mask & DPLL_UNLOCK_INTERRUPT_CTRL_BIT) {
        sys_hal_int_group2_enable(DPLL_UNLOCK_INTERRUPT_CTRL_BIT);
    }

    return BK_OK;
}
static void sys_hal_dpll_cpu_flash_time_early_init(uint32_t chip_id)
{
	uint32_t coresel = 0;
	uint32_t corediv = 0;
	//zhangheng20231018: calibrate dpll before use
	/*0x2:320M, 0X3:480M*/
	coresel = sys_ll_get_cpu_clk_div_mode1_cksel_core();
	corediv = sys_ll_get_cpu_clk_div_mode1_clkdiv_core();
	if((coresel != PM_CLKSEL_CORE_480M) || !sys_ana_ll_get_ana_reg1_manual())
	{
		sys_hal_cali_dpll(1);
	}

	/*default of MP flash 80M = 80/1*/
	if(sys_ll_get_cpu_clk_div_mode2_cksel_flash() != PM_CLKSEL_FLASH_80M)
	{
		if(sys_ll_get_cpu_clk_div_mode2_ckdiv_flash() != 0x0)// 80/1
		{
			sys_ll_set_cpu_clk_div_mode2_ckdiv_flash(0x0);
		}
		sys_hal_flash_set_clk(PM_CLKSEL_FLASH_80M);
	}

