Sparkleiot/BK7239N_AT/middleware/soc/bk7239n/hal/sys_hal.c
	/* clk_divd 120MHz,
	 * 1, the core clock is depended on CONFIG_CPU_FREQ_HZ and configSYSTICK_CLOCK_HZ.
	 *    Pay attention to bk_pm_module_vote_cpu_freq,and the routine will switch core
	 *    clock;
	 * 2, sysTick module's clock source is processor clock now;
	 */
	if((coresel != PM_CLKSEL_CORE_480M) && (corediv != 0x3))//160M
	{
		sys_hal_mclk_div_set(480000000/CONFIG_CPU_FREQ_HZ - 1);
		sys_hal_delay(10000);

		sys_hal_mclk_mux_set(PM_CLKSEL_CORE_480M);/*clock source: DPLL, 480M*/
	}
	timer_hal_us_init();

	/*increase the anaspi_freq, current it only use for lpo: external 32k, 26m/32k*/
	//if(bk_clk_32k_customer_config_get() != PM_LPO_SRC_ROSC)
	{
		sys_ll_set_cpu_anaspi_freq_anaspi_freq(0x2);//ana_sck = bus_clk/((divd+1)*2))
	}
}
static void sys_hal_pwd_rosc()
{
	volatile uint32_t count = PM_POWER_ON_ROSC_STABILITY_TIME;
	/*when the lpo src select external 32k or 26m/32k, it disable the rosc;because make sure write the analog register successfully*/
	if(bk_clk_32k_customer_config_get() != PM_LPO_SRC_ROSC)
	{
		if(aon_pmu_ll_get_r41_lpo_config() == PM_LPO_SRC_ROSC)
		{
			aon_pmu_ll_set_r41_lpo_config(PM_LPO_SRC_DIVD);
		}

		if(sys_ana_ll_get_ana_reg5_pwd_rosc_spi() != 0x1)
		{
			sys_ana_ll_set_ana_reg5_pwd_rosc_spi(0x1);
		}
	}
	else
	{
		if(sys_ana_ll_get_ana_reg5_pwd_rosc_spi() != 0x0)
		{
			sys_ana_ll_set_ana_reg5_pwd_rosc_spi(0x0);

			while(count--)//delay time for stability when power on rosc
			{
			}
		}
	}
}

static void sys_hal_get_boot_wakeup_int_status(void)
{
    uint32_t check_rtc_int_en = sys_ll_get_cpu0_int_32_63_en_cpu0_ana_rtc_int_en();
    uint32_t check_gpio_int_en = sys_ll_get_cpu0_int_32_63_en_cpu0_ana_gpio_int_en();

    if (check_rtc_int_en == 0) {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ana_rtc_int_en(1);
    }
    if (check_gpio_int_en == 0) {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ana_gpio_int_en(1);
    }

    boot_ana_rtc_int_status = sys_ll_get_cpu0_int_32_63_status_cpu0_ana_rtc_int_st();
    boot_ana_gpio_int_status = sys_ll_get_cpu0_int_32_63_status_cpu0_ana_gpio_int_st();

    if (check_rtc_int_en == 0) {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ana_rtc_int_en(0);
    }
    if (check_gpio_int_en == 0) {
        sys_ll_set_cpu0_int_32_63_en_cpu0_ana_gpio_int_en(0);
    }
}

uint32_t sys_hal_get_boot_ana_rtc_int_status(void)
{
	return boot_ana_rtc_int_status;
}

uint32_t sys_hal_get_boot_ana_gpio_int_status(void)
{
	return boot_ana_gpio_int_status;
}

//TODO the module owner can put the sys init to better place
void sys_hal_early_init(void)
{
	/*power down rosc, temp modify*/
	sys_hal_pwd_rosc();

	uint32_t chip_id = aon_pmu_hal_get_chipid();

	uint32_t val = sys_hal_analog_get(ANALOG_REG5);
	// power up dpll first
	val |= (0x1 << 5);
	sys_hal_analog_set(ANALOG_REG5,val);

	/* sys_persist_check_crc costs about 3 ms */
	if (sys_persist_check_crc()) {
		bk_misc_set_reset_reason(RESET_SOURCE_ILLEGAL_PERSIST_DATA);
		bk_reboot_ex(RESET_SOURCE_ILLEGAL_PERSIST_DATA);
		return;
	}

	sys_persist_sys_t *sys_ana = get_sys_persist_sys();
	sys_hal_analog_set(ANALOG_REG0, sys_ana->r0);
	sys_hal_analog_set(ANALOG_REG1, sys_ana->r1);
	sys_hal_analog_set(ANALOG_REG2, sys_ana->r2);
	sys_hal_analog_set(ANALOG_REG3, sys_ana->r3);
	sys_hal_analog_set(ANALOG_REG4, sys_ana->r4);
	sys_hal_analog_set(ANALOG_REG5, sys_ana->r5);
	sys_hal_analog_set(ANALOG_REG6, sys_ana->r6);
	sys_hal_analog_set(ANALOG_REG7, sys_ana->r7);
	sys_hal_analog_set(ANALOG_REG8, sys_ana->r8);

	// keep the rtc int status before RTC_KEEP_TIME_SUPPORT restore the time
	sys_hal_get_boot_wakeup_int_status();

	/**
	 * attention:
	 * SPI latch must be enable before ana_reg[8~13] modification
	 * and don't forget disable it after that.
	 */
	sys_ana_ll_set_ana_reg8_spi_latch1v(1);
#if CONFIG_AON_RTC_KEEP_TIME_SUPPORT
	sys_hal_analog_set(ANALOG_REG9, 0xB55D9327);//tenglong20240805:2M buck for EVM;tenglong20251011<13>=1
#else
	sys_hal_analog_set(ANALOG_REG9, sys_ana->r9);//tenglong20240805:2M buck for EVM
#endif
	sys_hal_analog_set(ANALOG_REG10, sys_ana->r10);
	sys_hal_analog_set(ANALOG_REG11, sys_ana->r11);
	sys_hal_analog_set(ANALOG_REG12, sys_ana->r12);
	sys_hal_analog_set(ANALOG_REG13, sys_ana->r13);
	sys_hal_analog_set(ANALOG_REG14, sys_ana->r14);
	sys_hal_analog_set(ANALOG_REG15, sys_ana->r15);
	sys_ana_ll_set_ana_reg8_spi_latch1v(0);

	/*early init cpu flash time*/
	sys_hal_dpll_cpu_flash_time_early_init(chip_id);

	//TODO: should be done with wifi_init->bk_pm_clock_ctrl
	sys_hal_clk_pwr_ctrl(CLK_PWR_ID_RF, CLK_PWR_CTRL_PWR_UP);
}

void sys_hal_set_scr_clk(uint32_t value)
{
}

/**  SCR End  */
void  sys_hal_set_cpu_cp_test_config(uint32_t cfg_id)
{
	uint32_t spi_latchlb;
	uint32_t vorehsel;
	switch (cfg_id) {
	case 0:
		//cpu clk 160MHz
		sys_ll_set_cpu_clk_div_mode1_cksel_core(0x1);  // select DPLL480MHz
		sys_ll_set_cpu_clk_div_mode1_clkdiv_core(0x2);  // DPLL480M/(1 + 2) = 160Mhz

		// volt 0.755v
		spi_latchlb = sys_ana_ll_get_reg8_value();
		spi_latchlb |= (0x1 << 9);
		sys_ana_ll_set_reg8_value(spi_latchlb);
		vorehsel = sys_ana_ll_get_reg8_value();
		vorehsel = (vorehsel & ~(0xF << 16)) | (0x7 << 16);
		sys_ana_ll_set_reg8_value(vorehsel);
		spi_latchlb = sys_ana_ll_get_reg8_value();
		spi_latchlb &= ~(0x1 << 9);
		sys_ana_ll_set_reg8_value(spi_latchlb);

		// sram rate 3
		sys_ll_set_cpu_power_sleep_wakeup_share_mem_clkgating_disable(0x1);
		sys_ll_set_cpu_device_mem_ctrl3_ram_config(0x233);
		sys_ll_set_cpu_power_sleep_wakeup_share_mem_clkgating_disable(0x0);

		break;
	case 1:
		//cpu clk 240MHz
		sys_ll_set_cpu_clk_div_mode1_cksel_core(0x1);  // select DPLL480MHz
		sys_ll_set_cpu_clk_div_mode1_clkdiv_core(0x1);  // DPLL480M/(1 + 1) = 240Mhz

		// volt 0.875v
		spi_latchlb = sys_ana_ll_get_reg8_value();
		spi_latchlb |= (0x1 << 9);
		sys_ana_ll_set_reg8_value(spi_latchlb);
		vorehsel = sys_ana_ll_get_reg8_value();
		vorehsel = (vorehsel & ~(0xF << 16)) | (0xB << 16);
		sys_ana_ll_set_reg8_value(vorehsel);
		spi_latchlb = sys_ana_ll_get_reg8_value();
		spi_latchlb &= ~(0x1 << 9);
		sys_ana_ll_set_reg8_value(spi_latchlb);

