Sparkleiot/BK7239N_AT/middleware/soc/bk7239n/hal/sys_hal.c
		// sram rate 1
		sys_ll_set_cpu_power_sleep_wakeup_share_mem_clkgating_disable(0x1);
		sys_ll_set_cpu_device_mem_ctrl3_ram_config(0x221);
		sys_ll_set_cpu_power_sleep_wakeup_share_mem_clkgating_disable(0x0);

		break;

	default:
		break;
	}
}

#define FLASH_MAX_CLK    120    // 120MHz
#define FLASH_80M_CLK    80    // 80MHz
#define CLK_XTAL    40    // 40MHz

void sys_hal_set_flash_clk(uint32_t flash_clk)
{
	uint32_t flash_max_clk = FLASH_MAX_CLK;
	uint32_t flash_80m_clk = FLASH_80M_CLK;
	uint32_t calculated_div = flash_80m_clk / flash_clk;
	uint32_t flash_div = 0;

	if (flash_clk == CLK_XTAL) {
		sys_ll_set_cpu_clk_div_mode2_cksel_flash(0);
	} else if (flash_clk == 80) {
		sys_ll_set_cpu_clk_div_mode2_cksel_flash(2);
		if (calculated_div == 1) {          //0:/1  1:/2  2:/4  3:8，it is invalid when cksel_flash=0 and 1
			flash_div = 0;
		} else if (calculated_div == 2) {
			flash_div = 1;
		} else if (calculated_div == 4) {
			flash_div = 2;
		} else {
			flash_div = 3;
		}
		sys_ll_set_cpu_clk_div_mode2_ckdiv_flash(flash_div);
	} else {
		calculated_div = flash_max_clk / flash_clk;
		sys_ll_set_cpu_clk_div_mode2_cksel_flash(3);
		if (calculated_div <= 1) {          //0:/1  1:/2  2:/4  3:8，it is invalid when cksel_flash=0 and 1
			flash_div = 0;
		} else if (calculated_div <= 2) {
			flash_div = 1;
		} else if (calculated_div <= 4) {
			flash_div = 2;
		} else {
			flash_div = 3;
		}
		sys_ll_set_cpu_clk_div_mode2_ckdiv_flash(flash_div);
	}
}

void sys_hal_set_cpu_clk(uint32_t cpu_clk)
{
	if (cpu_clk <= CLK_XTAL) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_XTAL);
	} else if (cpu_clk <= 60) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_60M);
	} else if (cpu_clk <= 80) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_80M);
	} else if (cpu_clk <= 120) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_120M);
	} else if (cpu_clk <= 160) {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_160M);
	} else {
		sys_hal_switch_cpu_bus_freq(PM_CPU_FRQ_240M);
	}
}